Repository: tariqmahmood898/mytonwallet
Catalog: mobile/ios/Air/SubModules/WalletContext/Resources/Strings/Localizable.xcstrings
Source language: en
Languages: de, es, pl, ru, th, tr, uk, zh_hans, zh_hant

# $service_token_transfer_warning
source: You are about to transfer an important service token required to withdraw your deposit or complete service operations. Please ensure this is the action you intend to take.
de: Sie sind dabei, ein wichtiges Service-Token zu übertragen, das erforderlich ist, um Ihre Einzahlung abzuheben oder Servicevorgänge abzuschließen. Bitte stellen Sie sicher, dass dies die beabsichtigte Aktion ist.
es: Está a punto de transferir un token de servicio importante necesario para retirar su depósito o completar operaciones de servicio. Asegúrese de que esta es la acción que desea realizar.
pl: Zamierzasz przenieść ważny token usługi wymagany do wypłaty depozytu lub ukończenia operacji serwisowych. Upewnij się, że jest to działanie, które chcesz wykonać.
ru: Вы собираетесь перевести важный служебный токен, необходимый для вывода вашего депозита или выполнения операций с сервисом. Убедитесь, что вы действительно хотите выполнить это действие.
th: คุณกำลังจะโอนโทเค็นบริการที่สำคัญซึ่งจำเป็นสำหรับการถอนเงินฝากหรือดำเนินการบริการให้เสร็จสิ้น โปรดตรวจสอบว่านี่คือสิ่งที่คุณตั้งใจทำ
tr: Mevduatınızı çekmek veya hizmet işlemlerini tamamlamak için gerekli olan önemli bir hizmet tokenini transfer etmek üzeresiniz. Bu işlemi yapmayı gerçekten istediğinizden emin olun.
uk: Ви збираєтеся передати важливий службовий токен, необхідний для виведення вашого депозиту або завершення сервісних операцій. Переконайтеся, що це саме та дія, яку ви хочете виконати.
zh_hans: 您即将转移一个重要的服务代币，该代币是提款或完成服务操作所必需的。请确保这是您打算执行的操作。
zh_hant: 您即將轉移一個重要的服務代幣，此代幣是提款或完成服務操作所必需的。請確保這是您計劃執行的操作。

# $settings_nft_probably_scam_description
source: These NFTs were automatically disabled by Anti-Scam Protection. You can return the necessary ones to Home if you think they were included in this list by mistake.
de: Diese NFTs wurden automatisch von der Anti-Betrug-Schutz deaktiviert. Sie können die erforderlichen NFTs wieder zur Startseite zurückbringen, wenn Sie denken, dass sie fälschlicherweise in dieser Liste enthalten sind.
es: Estos NFTs fueron desactivados automáticamente por la Protección Anti-Estafa. Puedes devolver los necesarios a la página principal si crees que fueron incluidos en esta lista por error.
pl: Te NFT zostały automatycznie wyłączone przez Ochronę przed Oszustwami. Możesz przywrócić potrzebne z powrotem na Stronę Główną, jeśli uważasz, że zostały one omyłkowo dodane do tej listy.
ru: Эти NFT были автоматически отключены Защитой от мошенничества. Вы можете вернуть нужные на Главную страницу, если считаете, что они были включены в этот список по ошибке.
th: NFT เหล่านี้ถูกปิดใช้งานโดยอัตโนมัติโดยการป้องกันการหลอกลวง คุณสามารถคืนที่จำเป็นไปยังหน้าแรกหากคุณคิดว่าพวกมันถูกเพิ่มในรายการนี้โดยความผิดพลาด
tr: Bu NFT'ler Dolandırıcılık Koruması tarafından otomatik olarak devre dışı bırakıldı. Yanlışlıkla bu listeye eklendiklerini düşünüyorsanız gerekli olanları Ana Sayfa'ya geri döndürebilirsiniz.
uk: Ці NFT були автоматично вимкнені Захистом від шахрайства. Ви можете повернути необхідні на Головну, якщо вважаєте, що вони були включені до цього списку помилково.
zh_hans: 这些NFT被反诈骗保护自动禁用。如果您认为它们被错误地包含在此列表中，您可以将必要的返回主页。
zh_hant: 這些NFT被反詐騙保護自動禁用。如果您認為它們被錯誤地包含在此列表中，您可以將必要的返回主頁。

# $signature_warning
source: Signing custom data is very dangerous. Use it only if you trust the source of it.
de: Das Signieren von benutzerdefinierten Daten ist sehr gefährlich. Verwenden Sie es nur, wenn Sie der Quelle vertrauen.
pl: Podpisywanie niestandardowych danych jest bardzo niebezpieczne. Używaj go tylko wtedy, gdy ufasz jego źródłu.
ru: Подписание данных влечёт риски. Используйте эту опцию, только если вы доверяете их источнику.
th: การเซ็นข้อมูลที่กำหนดเองอาจมีความเสี่ยงสูง. โปรดใช้เมื่อคุณใว้ใจแหล่งที่มาของข้อมูลนั้น.
tr: Özelleştirilmiş verilerin imzalanması çok tehlikelidir. Yalnızca kaynağına güveniyorsanız kullanın.
uk: Підписання даних тягне за собою ризики. Використовуйте цю опцію, тільки якщо ви довіряєте джерелу.
zh_hans: 签署自定义数据是**非常危险**的！仅当您信任其来源时才使用它！
zh_hant: 簽署自定義資訊是非常危險的。僅當您信任其來源時才使用它。

# $stake_asset
source: Stake %1$@
de: %1$@ staken
es: Apostar %1$@
pl: Stakuj %1$@
ru: Застейкать %1$@
th: วางเดิมพัน %1$@
tr: %1$@ stake et
uk: Застейкати %1$@
zh_hans: 质押 %1$@
zh_hant: 質押 %1$@

# $state_init_invalid
source: Invalid contract initialization data.
de: Ungültige Vertragsinitialisierungsdaten.
es: Datos de inicialización de contrato inválidos.
pl: Nieprawidłowe dane inicjalizacji kontraktu.
ru: Неверные данные инициализации контракта.
th: ข้อมูลการเริ่มต้นสัญญาไม่ถูกต้อง.
tr: Geçersiz sözleşme başlatma verileri.
uk: Невірні дані ініціалізації контракту.
zh_hans: 无效的合同初始化数据。
zh_hant: 無效的合同初始化數據。

# $storage_cleared_message
source: Your wallet data has been cleared due to browser-related or disk space issues. Please log out from all wallets and then re-import them manually using your secret words. If you need assistance, please contact %1$@.
de: Ihre Wallet-Daten wurden aufgrund von Browser- oder Speicherplatz-Problemen gelöscht. Bitte loggen Sie sich aus allen Wallets aus und importieren Sie sie dann manuell mit Ihren geheimen Wörtern erneut. Wenn Sie Unterstützung benötigen, kontaktieren Sie bitte %1$@.
es: Los datos de su billetera han sido borrados debido a problemas del navegador o de espacio en disco. Por favor, cierre sesión de todas las billeteras y luego impórtelas manualmente usando sus palabras secretas. Si necesita asistencia, por favor contacte a %1$@.
pl: Dane portfela zostały wyczyszczone z powodu problemów z przeglądarką lub miejscem na dysku. Proszę wylogować się ze wszystkich portfeli, a następnie ręcznie zaimportować je ponownie, używając swoich sekretnych słów. Jeśli potrzebujesz pomocy, skontaktuj się z %1$@.
ru: Данные вашего кошелька были очищены из-за проблем с браузером или дисковым пространством. Пожалуйста, выйдите из всех кошельков и затем вручную импортируйте их снова, используя ваши секретные слова. Если вам нужна помощь, пожалуйста, свяжитесь с %1$@.
th: ข้อมูลกระเป๋าเงินของคุณถูกล้างออกเนื่องจากปัญหาเบราว์เซอร์หรือเนื้อที่ดิสก์ กรุณาออกจากกระเป๋าเงินทั้งหมดแล้วนำเข้าใหม่ด้วยตนเองโดยใช้คำลับของคุณ หากคุณต้องการความช่วยเหลือ กรุณาติดต่อ %1$@
tr: Cüzdan verileriniz tarayıcı veya disk alanı sorunları nedeniyle temizlenmiştir. Lütfen tüm cüzdanlardan çıkış yapın ve ardından gizli kelimelerinizi kullanarak onları manuel olarak yeniden içe aktarın. Yardıma ihtiyacınız varsa, lütfen %1$@ ile iletişime geçin.
uk: Дані вашого гаманця були очищені через проблеми з браузером або дисковим простором. Будь ласка, вийдіть з усіх гаманців і потім вручну імпортуйте їх знову, використовуючи ваші секретні слова. Якщо вам потрібна допомога, будь ласка, зв'яжіться з %1$@.
zh_hans: 您的钱包数据因浏览器或磁盘空间问题而被清除。请从所有钱包中退出登录，然后使用您的助记词手动重新导入。 如需帮助，请联系%1$@。
zh_hant: 您的錢包資料因瀏覽器或磁碟空間問題而被清除。請從所有錢包中登出，然後使用您的助記詞手動重新匯入。 如需協助，請聯繫%1$@。

# $storage_cleared_title
source: Application Storage Cleared
de: Anwendungsspeicher gelöscht
es: Almacenamiento de la aplicación borrado
pl: Pamięć aplikacji została wyczyszczona
ru: Хранилище очищено
th: ที่เก็บข้อมูลแอปพลิเคชันถูกล้าง
tr: Uygulama Depolaması Temizlendi
uk: Сховище застосунку очищено
zh_hans: 应用程序存储已清除
zh_hant: 應用程式儲存已清除

# $swap_action
source: Swap
de: Tausch
es: Intercambiar
pl: Wymieniać
ru: Обмен
th: สับเปลี่ยน
tr: Takas
uk: Обмін
zh_hans: 交换
zh_hant: 交換

# $swap_aggregator_fee_tooltip
source: A built-in **DEX aggregator** finds the **best rate** across available DEXes. Service fee is %1$@.
de: Ein integrierter **DEX-Aggregator** findet den **besten Kurs** über verfügbare DEXs. Die Servicegebühr beträgt %1$@.
es: Un **agregador DEX** incorporado encuentra la **mejor tasa** entre los DEX disponibles. La tarifa de servicio es del %1$@.
pl: Wbudowany **agregator DEX** znajduje **najlepszy kurs** w dostępnych DEX-ach. Opłata za usługę wynosi %1$@.
ru: Встроенный **DEX-агрегатор** помогает выбрать **лучший курс** среди доступных бирж. Комиссия сервиса — %1$@.
th: ตัวรวบรวม **DEX ในตัว** จะค้นหา **อัตราที่ดีที่สุด** จาก DEX ที่มีอยู่ ค่าบริการคือ %1$@.
tr: Dahili bir **DEX toplayıcı**, mevcut DEX'ler arasında **en iyi oranı** bulur. Hizmet ücreti %1$@.
uk: Вбудований **агрегатор DEX** знаходить **найкращий курс** серед доступних DEX. Плата за послугу становить %1$@.
zh_hans: 内置的 **DEX 聚合器** 会在可用的 DEX 中找到 **最佳汇率**。服务费为 %1$@。
zh_hant: 內建的 **DEX 聚合器** 會在可用的 DEX 中找到 **最佳匯率**。服務費為 %1$@。

# $swap_changelly_agreement_message
source: By continuing, you agree to the %1$@ and %2$@ and understand that the transaction may trigger verification according to %3$@.
de: Mit der Fortsetzung stimmen Sie den %1$@ und %2$@ zu und verstehen, dass die Transaktion gemäß den %3$@-Bestimmungen verifiziert werden kann.
es: Al continuar, usted acepta los %1$@ y %2$@ y comprende que la transacción puede desencadenar una verificación según el %3$@.
pl: Kontynuując, zgadzasz się na %1$@ i %2$@ oraz rozumiesz, że transakcja może wymagać weryfikacji zgodnie z %3$@.
ru: Продолжая, вы соглашаетесь с %1$@ и %2$@ и понимаете, что транзакция может вызвать проверку в соответствии с %3$@.
th: การดำเนินการต่อ, แสดงว่าคุณยอมรับ %1$@ และ %2$@ และเข้าใจว่าธุรกรรมอาจเกิดการทริกเกอร์การยืนยันตาม %3$@
tr: Devam ederek, %1$@ ve %2$@'yi kabul etmiş ve işlemin %3$@ kurallarına göre doğrulama sürecini başlatabileceğini anlamış olursunuz.
uk: Продовжуючи, ви погоджуєтеся з %1$@ і %2$@ і розумієте, що транзакція може викликати перевірку відповідно до %3$@.
zh_hans: 继续操作，即表示您同意 %1$@ 和 %2$@，并理解该交易可能会触发根据 %3$@ 进行的验证。
zh_hant: 繼續操作即表示您同意 %1$@ 和 %2$@，並理解該交易可能會觸發根據 %3$@ 的驗證。

# $swap_changelly_from_ton_description
source: Tokens will be sent to your address in %1$@ blockchain soon:
de: Token werden in Kürze an Ihre Adresse in der %1$@-Blockchain gesendet:
es: Los tokens se enviarán pronto a su dirección en %1$@ blockchain:
pl: Tokeny zostaną wysłane na twój adres w blockchainie %1$@ w ciągu kilku chwil:
ru: Токены скоро будут отправлены на ваш адрес в блокчейне %1$@:
th: โทเค็นจะถูกส่งไปยังที่อยู่ %1$@ ของคุณเร็วๆ นี้:
tr: Yakında %1$@ blockchain'deki adresinize jetonlar gönderilecek:
uk: Токени буде відправлено на вашу адресу в блокчейні %1$@ найближчим часом:
zh_hans: 代币将很快发送到您在%1$@区块链中的地址：
zh_hant: 代幣將很快發送到您在%1$@區塊鏈中的地址：

# $swap_changelly_kyc_security
source: Please contact **%1$@** and provide **Transaction ID** to pass the KYC procedure:
de: Bitte kontaktieren Sie **%1$@** und geben Sie die **Transaktions-ID** an, um das KYC-Verfahren zu bestehen:
es: Comuníquese con **%1$@** y proporcione **ID de transacción** para pasar el procedimiento KYC:
ru: Пожалуйста, свяжитесь с командой безопасности по адресу **%1$@** и предоставьте идентификатор транзакции, чтобы пройти процедуру KYC:
th: โปรดติดต่อ **%1$@** และระบุ **รหัสธุรกรรม** เพื่อผ่านขั้นตอน KYC:
tr: Lütfen **%1$@** ile iletişime geçin ve KYC prosedürünü geçmek için **İşlem Kimliğini** sağlayın:
zh_hans: 请联系**%1$@**并提供**交易ID**以通过KYC程序：
zh_hant: 請聯絡**%1$@**並提供**交易ID**以通過KYC程序：

# $swap_changelly_privacy_policy
source: privacy policy
de: Datenschutzrichtlinie
es: política de privacidad
pl: polityka prywatności
ru: политикой конфиденциальности
th: นโยบายความเป็นส่วนตัว
tr: gizlilik politikası
uk: політикою конфіденційності
zh_hans: 隐私政策
zh_hant: 隱私政策

# $swap_changelly_support
source: If there are any problems, please contact %1$@ or %2$@ and provide **Transaction ID**:
de: Bei Problemen wenden Sie sich bitte an %1$@ oder %2$@ und geben Sie die **Transaktions-ID** an:
es: Si hay algún problema, comuníquese con %1$@ o %2$@ y proporcione **ID de transacción**:
pl: W przypadku jakichkolwiek problemów skontaktuj się z %1$@ lub %2$@ i podaj **ID transakcji**:
ru: В случае возникновения проблем свяжитесь с Changelly через %1$@ или %2$@ и сообщите **идентификатор транзакции**:
th: หากมีปัญหาใดๆ โปรดติดต่อ %1$@ หรือ %2$@ และแจ้ง **รหัสธุรกรรม**:
tr: Herhangi bir sorun varsa lütfen %1$@ veya %2$@ ile iletişime geçin ve **İşlem Kimliğini** sağlayın:
uk: Якщо виникнуть проблеми, зв’яжіться з чатом %1$@ або %2$@ і надайте **Ідентифікатор транзакції**:
zh_hans: 如果有任何问题，请联系%1$@或%2$@并提供**交易ID**：
zh_hant: 如果有任何問題，請聯絡%1$@或%2$@並提供**交易ID**：

# $swap_changelly_terms_of_use
source: terms of use
de: Nutzungsbedingungen
es: términos de uso
pl: warunki korzystania
ru: условиями использования
th: ข้อกำหนดการใช้งาน
tr: kullanım şartları
uk: умовами використання
zh_hans: 使用条款
zh_hant: 使用條款

# $swap_changelly_to_ton_description1
source: Send %1$@ to this address in %2$@ blockchain within %3$@
de: Sie müssen %1$@ an diese Adresse in der %2$@-Blockchain innerhalb von %3$@ senden.
es: Debe enviar %1$@ a esta dirección en la cadena de bloques %2$@ dentro de %3$@
pl: Wyślij %1$@ na ten adres w blockchainie %2$@ w ciągu %3$@
ru: Отправьте %1$@ на этот адрес в блокчейне %2$@ в течение %3$@
th: ส่ง %1$@ ไปยังที่อยู่นี้ใน %2$@ บล็อกเชนภายใน %3$@
tr: %1$@ tutarını %2$@ içinde %3$@ blok zincirindeki bu adrese göndermelisiniz
uk: Надішліть %1$@ на цю адресу в блокчейні %2$@ протягом %3$@
zh_hans: 您必须在 %1$@ 内将 %2$@ 发送到此地址 在 %3$@ 区块链中
zh_hant: 您必須在 %1$@ 內將 %2$@ 發送到此地址 在 %3$@ 區塊鏈中

# $swap_dex_chooser_rate_title
source: Analyzed actual rates on **DeDust** and **STON.fi** to use the **best rate**.
de: Analysierte tatsächliche Kurse auf **DeDust** und **STON.fi**, um den **besten Kurs** zu verwenden.
es: Tasas actuales analizadas en **DeDust** y **STON.fi** para usar la **mejor tasa**.
pl: Przeanalizowane rzeczywiste kursy na **DeDust** i **STON.fi**, aby wybrać **najlepszy kurs**.
ru: Мы проанализировали актуальные курсы на **DeDust** и **STON.fi**, чтобы выбрать **наиболее выгодный курс**.
th: อัตราที่แท้จริงที่วิเคราะห์จาก **DeDust** และ **STON.fi** เพื่อใช้ **อัตราที่ดีที่สุด**.
tr: **DeDust** ve **STON.fi** üzerindeki analiz edilen gerçek oranlar, **en iyi kuru** kullanmak için.
uk: Проаналізовані актуальні курси на **DeDust** та **STON.fi** для використання **найкращого курсу**.
zh_hans: 在 **DeDust** 和 **STON.fi** 上分析的实际汇率，以便使用 **最佳汇率**。
zh_hant: 在 **DeDust** 和 **STON.fi** 上分析的實際匯率，以便使用 **最佳匯率**。

# $swap_from_to
source: Swap %1$@ %2$@ %3$@
de: Tauschen %1$@ %2$@ %3$@
es: Intercambiar %1$@ %2$@ %3$@
pl: Zamień %1$@ %2$@ %3$@
ru: Обменять %1$@ %2$@ %3$@
th: จาก %1$@ เป็น %2$@
tr: %1$@ %2$@ %3$@ değiştirin
uk: Обміняти %1$@ %2$@ %3$@
zh_hans: 从 %1$@ 交换至 %2$@
zh_hant: 從 %1$@ 交換至 %2$@

# $swap_minimum_received_tooltip1
source: This is the least amount of new tokens you'll get from this swap, considering current market conditions, slippage tolerance, and potential price impact.
de: Dies ist die geringste Menge an neuen Token, die Sie bei diesem Tausch erhalten, unter Berücksichtigung der aktuellen Marktkonditionen, der Schlupftoleranz und möglicher Preisauswirkungen
es: Esta es la cantidad mínima de nuevos tokens que recibirá en este intercambio, considerando las condiciones actuales del mercado, la tolerancia al deslizamiento y el posible impacto en el precio.
pl: To jest najmniejsza ilość nowych tokenów, jakie otrzymasz z tej wymiany, biorąc pod uwagę aktualne warunki rynkowe, tolerancję poślizgu i potencjalny wpływ na cenę.
ru: Это наименьшее количество новых токенов, которое вы получите от этого обмена, учитывая текущие условия рынка, допустимое проскальзывание и потенциальное влияние на цену.
th: นี่คือจำนวนโทเค็นใหม่ที่ตำ่สุดที่คุณจะได้รับจากการแลกเปลี่ยนนี้ โดยพิจารณาจากสภาวะตลาดในปัจจุบัน การยอมรับความคลาดเคลื่อนของราคา และผลกระทบด้านราคาที่อาจเกิดขึ้น.
tr: Mevcut piyasa koşulları, kayma toleransı ve potansiyel fiyat etkisi göz önüne alındığında, bu takastan elde edeceğiniz en az yeni token miktarı budur.
uk: Це найменша кількість нових токенів, яку ви отримаєте від цього обміну, враховуючи поточні умови ринку, допустиме прослизання і потенційний вплив на ціну.
zh_hans: 这是您从此次交换中可能获得的最少新代币数量，考虑了目前市场条件、滑点容忍度和潜在价格影响。
zh_hant: 這是您從此次交換中可能獲得的最少新代幣數量，考慮了目前市場條件、滑點容忍度和潛在價格影響。

# $swap_minimum_received_tooltip2
source: It's an expected minimum, but if the conditions change a lot while your swap is being processed, the final amount could be less.
de: Es handelt sich um ein erwartetes Minimum, aber wenn sich die Bedingungen während der Verarbeitung Ihres Tausches stark ändern, könnte der endgültige Betrag geringer ausfallen.
es: Es un mínimo esperado, pero si las condiciones cambian mucho mientras su intercambio está siendo procesado, la cantidad final podría ser menor.
pl: To oczekiwane minimum, ale jeśli warunki zmienią się znacznie podczas przetwarzania twojej wymiany, końcowa kwota może być mniejsza.
ru: Это ожидаемое минимальное значение, но, если условия сильно изменятся во время обработки вашего обмена, итоговая сумма может быть меньше.
th: ซึ่งเป็นจำนวนขั้นต่ำที่คาดไว้, แต่อาจจะเงื่อนไขเปลี่ยนแปลงไปในขณะที่กำลังประมวลผลระหว่างสับเปลี่ยน จำนวนมูลค่าที่ได้รับอาจจะลดลง.
tr: Bu beklenen minimum tutardır, ancak takasınız işleme konurken koşullar çok değişirse, nihai tutar daha az olabilir.
uk: Це очікуване мінімальне значення, але, якщо умови сильно зміняться під час обробки вашого обміну, підсумкова сума може бути меншою.
zh_hans: 这是预期的最低值，但如果在处理您的交换时条件发生很大变化，最终金额可能会较少。
zh_hant: 這是預期的最低值，但如果在處理您的交換時條件發生很大變化，最終金額可能會較少。

# $swap_price_impact_tooltip1
source: This shows how much your trade might change the token's price.
de: Dies zeigt, wie sehr Ihr Handel den Preis des Tokens ändern könnte.
es: Esto muestra cuánto puede cambiar el precio de su operación el precio del token.
pl: Pokazuje, jak bardzo twoja transakcja może zmienić cenę tokena.
ru: Это показывает, насколько ваша сделка может изменить цену токена.
th: นี่แสดงให้เห็นว่าการแลกเปลี่ยนของคุณอาจเปลี่ยนแปลงราคาโทเค็นได้มากเพียงใด.
tr: Bu, işleminizin token fiyatını ne kadar değiştirebileceğini gösterir.
uk: Це показує, наскільки ваша угода може змінити ціну токена.
zh_hans: 这显示了您的交易可能对代币价格造成的影响。
zh_hant: 這顯示了您的交易可能對代幣價格造成的影響。

# $swap_price_impact_tooltip2
source: Big trades can make the price go up or down more. Lower is usually better.
de: Große Trades können den Preis stärker nach oben oder unten bewegen. In der Regel ist ein niedrigerer Wert besser.
es: Las operaciones grandes pueden hacer que el precio suba o baje más. En general, es mejor un valor más bajo.
pl: Duże transakcje mogą spowodować większy wzrost lub spadek ceny. Zazwyczaj niższa wartość jest lepsza.
ru: Большие сделки могут сильнее повлиять на цену. В целом, меньшее значение лучше.
th: หากมีซื้อขายขนาดใหญ่เกิดขึ้นอาจทำให้ราคาขึ้นหรือลงอย่างรวดเร็ว, ซื้อขายขนาดเล็กจะมีผลดีกว่า.
tr: Yüksek hacimli alım satımlar fiyatın daha fazla yükselmesine veya düşmesine neden olabilir. Daha düşük tutarlar genellikle daha iyidir.
uk: Великі угоди можуть сильніше вплинути на ціну. Загалом, менше значення краще.
zh_hans: 大型交易可能会使价格上涨或下跌得更多。较低的值通常较好。
zh_hant: 大型交易可能會使價格上漲或下跌得更多。較低的值通常較好。

# $swap_reverse_prohibited
source: Setting the buy amount is impossible for this pair of tokens
de: Das Festlegen des Kaufbetrags ist für dieses Tokenpaar nicht möglich
es: Configurar la cantidad de compra es imposible para este par de tokens
pl: Ustawienie kwoty zakupu jest niemożliwe dla tej pary tokenów
ru: Указание суммы покупки невозможно для этой пары токенов
th: การตั้งค่าจำนวนซื้อเป็นไปไม่ได้สำหรับคู่โทเค็นนี้
tr: Bu token çifti için satın alma miktarını ayarlamak imkansız
uk: Встановити суму покупки для цієї пари токенів неможливо
zh_hans: 无法为这对代币设置购买金额
zh_hant: 無法為這對代幣設置購買金額

# $swap_slippage_tooltip1
source: This sets how much the price is allowed to change before your swap is processed.
de: Dies legt fest, wie viel sich der Preis ändern darf, bevor Ihr Tausch verarbeitet wird.
es: Esto establece cuánto se permite que el precio cambie antes de que se procese su intercambio.
pl: Ustawia, o ile cena może się zmienić przed przetworzeniem twojej wymiany.
ru: Здесь устанавливается, насколько цена может измениться, прежде чем ваш обмен будет обработан.
th: นี่เป็นราคาที่กำหนดที่อนุญาตให้เปลี่ยนแปลงได้ก่อนที่การสับเปลี่ยนของคุณจะถูกประมวลผล.
tr: Bu, takas talebinizin işleme alınmadan önce fiyatın ne kadar değişmesine izin verileceğini belirler.
uk: Тут встановлюється, наскільки ціна може змінитися, перш ніж ваш обмін буде оброблено.
zh_hans: 设置此值可以允许价格在进行交换前发生变化的程度。
zh_hant: 設置此值可以允許價格在進行交換前發生變化的程度。

# $swap_slippage_tooltip2
source: If during the processing of your swap, the price changes more than this value, your order will be canceled.
de: Wenn sich während der Verarbeitung Ihres Tausches der Preis um mehr als diesen Wert ändert, wird Ihre Bestellung storniert.
es: Si durante el procesamiento de su intercambio, el precio cambia más que este valor, su orden será cancelada.
pl: Jeśli podczas przetwarzania twojej wymiany cena zmieni się bardziej niż ta wartość, twoje zamówienie zostanie anulowane.
ru: Если во время обработки вашего обмена цена изменится больше, чем на это значение, ваш заказ будет отменён.
th: หากระหว่างการประมวลผลสับเปลี่ยนของคุณ, แล้วมีราคาเปลี่ยนแปลงเกิดขึ้น, ออเดอร์ของคุณจะถูกยกเลิก.
tr: Takas işleminiz sırasında fiyat bu değerden daha fazla değişirse, emriniz iptal edilecektir.
uk: Якщо під час обробки вашого обміну ціна зміниться більше, ніж на це значення, ваше замовлення буде скасовано.
zh_hans: 如果在处理您的交换时，价格变化超过此值，您的订单将被取消。
zh_hant: 如果在處理您的交換時，價格變化超過此值，您的訂單將被取消。

# $swap_too_small_amount
source: Too small amount
de: Zu kleiner Betrag
es: Cantidad demasiado pequeña
pl: Zbyt mała kwota
ru: Слишком маленькая сумма
th: จำนวนเงินน้อยเกินไป
tr: Çok küçük miktar
uk: Занадто мала сума
zh_hans: 金额太小
zh_hant: 金額太小

# $tiny_transfers_help
source: Hide transfers worth less than $%1$@. Keep in mind: small amounts are often sent by spammers and scammers.
de: Schalten Sie dies aus, um Transaktionen von weniger als $%1$@ anzuzeigen. Bitte beachten Sie, dass solche Transaktionen oft für Spam- und Betrugszwecke verwendet werden.
es: Desactive esta opción para mostrar transacciones de menos de $%1$@. Tenga en cuenta que tales transacciones se utilizan a menudo con fines de spam y estafa.
pl: Wyłącz to, aby wyświetlać transakcje o wartości mniejszej niż $%1$@. Proszę pamiętaj, że tego typu transakcje często są wykorzystywane w celach spamowych i oszustw.
ru: Скрыть переводы стоимостью менее $%1$@. Имейте в виду — такие суммы часто отправляют спамеры и мошенники.
th: ปิดการแสดงรายการที่มีมูลค่าไม่เกิน $%1$@. โปรดทราบว่าธุรกรรมดังกล่าวมักมีวัตถุประสงค์ในการสแปมและการหลอกลวง.
tr: Tutarı $%1$@'den az olan işlemleri görüntülemek için bu düğmeyi kapalı konuma getirin. Lütfen bu tür işlemlerin genellikle spam ve dolandırıcılık amacıyla kullanıldığını unutmayın.
uk: Вимкніть цю опцію, щоб показувати перекази вартістю менше $%1$@. Майте на увазі, що такі перекази часто використовуються для спаму та шахрайства.
zh_hans: 关闭此功能以显示少于 $%1$@ 的交易。 请注意，此类交易通常用于垃圾信息和诈骗目的。
zh_hant: 開啟此功能，隱藏少於 $%1$@ 的交易。 請注意，此類交易通常用於垃圾郵件和詐騙目的。

# $total
source: Total: %1$@
de: Gesamt: %1$@
pl: Suma: %1$@
ru: Всего: %1$@
th: ทั้งหมด: %1$@
tr: Toplam: %1$@
uk: Усього: %1$@
zh_hans: 总计: %1$@
zh_hant: 總額: %1$@

# $transaction_from
source: from %1$@
de: von %1$@
es: de %1$@
pl: od %1$@
ru: от %1$@
th: จาก %1$@
tr: bu adresten = %1$@
uk: від %1$@
zh_hans: 从 %1$@
zh_hant: 從 %1$@

# $transaction_on
source: on %1$@
de: auf %1$@
es: en %1$@
pl: na %1$@
ru: на %1$@
th: บน %1$@
tr: %1$@'ta
uk: на %1$@
zh_hans: 上 %1$@
zh_hant: 上 %1$@

# $transaction_to
source: to %1$@
de: an %1$@
es: a %1$@
pl: do %1$@
ru: на %1$@
th: ถึง %1$@
tr: bu adrese = %1$@
uk: на %1$@
zh_hans: 至 %1$@
zh_hant: 到 %1$@
